Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.Select Method (ArrayList, Boolean)
 Selects a list of objects from the user interface.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	ArrayList ModelObjects,
	bool ShowDimensions
)
Public Function Select (
	ModelObjects As ArrayList,
	ShowDimensions As Boolean
) As Boolean
Parameters
ModelObjects
Type: System.Collections.ArrayList
The list of model objects to select.
ShowDimensions
Type: System.Boolean
Defines whether to show dimensions of the parts in the selection.
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelObjectSelector Class
Select Overload
Tekla.Structures.Model.UI Namespace